* Операции git [[file:~/org/sbcl/Git-memo.org][Git-memo.org]]

* Генерирование документации при помощи Codex

 http://commondoc.github.io/codex/docs/tutorial.html

 [[file:~/org/sbcl/codex.org][Codex]]

* Пример генерирования документации
#+name: pwd
#+BEGIN_SRC shell
pwd
#+END_SRC

#+name: basename-pwd
#+BEGIN_SRC shell
basename `pwd`
#+END_SRC

#+BEGIN_SRC lisp :var pwd=pwd :var basename-pwd=basename-pwd
  ;;;; (require :codex)
  ;;;; (require :mnas-package)
  ;;;;
  ;;;; (require :mnas-string)
  (let ((pkg :mnas-logical)
	(fpath (concatenate 'string pwd "/docs/build/" basename-pwd "/html/")))
    (codex:document pkg)
    (mnas-package:package-call-graph   pkg :out-type "png" :viewer nil :fpath fpath :fname "call-graph")
    (mnas-package:package-system-graph pkg :out-type "png" :viewer nil :fpath fpath :fname "system-graph")
    (mnas-package:package-class-graph  pkg :out-type "png" :viewer nil :fpath fpath :fname "class-graph")
    (mnas-package:package-symbol-graph pkg :out-type "png" :viewer nil :fpath fpath :fname "symbol-graph"))
#+END_SRC

#+RESULTS:
: #GRAPH(VC=0 RC=0)
